var subway_list = [
    {
        "name" : "동대문역사",
        "line" : "2",
        "x" : 11,
        "y" : 66
    }, {
        "name" : "충무로",
        "line" : "2",
        "x" : 0,
        "y" : 53.5
    },{
        "name" : "명동",
        "line" : "4",
        "x" : -9,
        "y" : 53.5
    }, {
        "name" : "회현",
        "line" : "4",
        "x" : -17.5,
        "y" : 49.5
    }, {
        "name" : "서울역",
        "line" : "4",
        "x" : -22,
        "y" : 41
    }, {
        "name" : "숙대입구",
        "line" : "4",
        "x" : -17.5,
        "y" : 31.5
    }, {
        "name" : "심각지",
        "line" : "4",
        "x" : -7.5,
        "y" : 28.4
    }, {
        "name" : "신용산",
        "line" : "4",
        "x" : 0,
        "y" : 16.5
    }, {
        "name" : "이촌",
        "line" : "4",
        "x" : 0,
        "y" : 0
    },{
        "name" : "동작",
        "line" : "4",
        "x" : 0,
        "y" : -17
    }, {
        "name" : "충신대",
        "line" : "4",
        "x" : 0,
        "y" : -34
    }, {
        "name" : "남태령",
        "line" : "4",
        "x" : 0,
        "y" : -60
    }, {
        "name" : "선바위",
        "line" : "4",
        "x" : 0,
        "y" : -68
    }, {
        "name" : "사당",
        "line" : "2",
        "x" : 0,
        "y" : -51
    }, {
        "name" : "방배",
        "line" : "2",
        "x" : 11.5,
        "y" : -51
    }, {
        "name" : "서초",
        "line" : "2",
        "x" : 19,
        "y" : -51
    }, {
        "name" : "교대",
        "line" : "2",
        "x" : 27,
        "y" : -51
    }, {
        "name" : "강남",
        "line" : "2",
        "x" : 39.5,
        "y" : -51
    }, {
        "name" : "역삼",
        "line" : "2",
        "x" : 51,
        "y" : -51
    }, {
        "name" : "선릉",
        "line" : "2",
        "x" : 62,
        "y" : -51
    }, {
        "name" : "삼성",
        "line" : "2",
        "x" : 71,
        "y" : -46
    }, {
        "name" : "종합",
        "line" : "2",
        "x" : 77.5,
        "y" : -39.5
    }, {
        "name" : "잠살시내",
        "line" : "2",
        "x" : 81.5,
        "y" : -28.5
    }, {
        "name" : "잠실",
        "line" : "2",
        "x" : 81.5,
        "y" : -21.3
    },{
        "name" : "잘실나루",
        "line" : "2",
        "x" : 81.5,
        "y" : -6
    },  {
        "name" : "강변",
        "line" : "2",
        "x" : 81.5,
        "y" : 15
    }, {
        "name" : "구의",
        "line" : "2",
        "x" : 81.5,
        "y" : 21
    }, {
        "name" : "건대",
        "line" : "2",
        "x" : 81.5,
        "y" : 30
    }, {
        "name" : "성수",
        "line" : "2",
        "x" : 81.5,
        "y" : 40.5
    }, {
        "name" : "뚝섬",
        "line" : "2",
        "x" : 79.5,
        "y" : 51
    }, {
        "name" : "한양대",
        "line" : "2",
        "x" : 74,
        "y" : 59
    }, {
        "name" : "왕십리",
        "line" : "2",
        "x" : 63,
        "y" : 65
    }, {
        "name" : "상왕십리",
        "line" : "2",
        "x" : 46,
        "y" : 66
    }, {
        "name" : "신당",
        "line" : "2",
        "x" : 29,
        "y" : 66
    }, {
        "name" : "을지로4가",
        "line" : "2",
        "x" : 3.5,
        "y" : 66
    }, {
        "name" : "을지로3가",
        "line" : "2",
        "x" : -6.5,
        "y" : 66
    }, {
        "name" : "을지로입구",
        "line" : "2",
        "x" : -14,
        "y" : 66
    }, {
        "name" : "시청",
        "line" : "2",
        "x" : -23,
        "y" : 66
    }, {
        "name" : "충정로",
        "line" : "2",
        "x" : -40,
        "y" : 66
    }, {
        "name" : "아현",
        "line" : "2",
        "x" : -52,
        "y" : 66
    }, {
        "name" : "이대",
        "line" : "2",
        "x" : -63.5,
        "y" : 63.5
    }, {
        "name" : "신촌",
        "line" : "2",
        "x" : -72,
        "y" : 57
    }, {
        "name" : "홍대입구",
        "line" : "2",
        "x" : -77,
        "y" : 46
    }, {
        "name" : "합정",
        "line" : "2",
        "x" : -77.5,
        "y" : 29
    }, {
        "name" : "당산",
        "line" : "2",
        "x" : -77.5,
        "y" : 11.5
    }, {
        "name" : "영등포구청",
        "line" : "2",
        "x" : -77.5,
        "y" : -1
    }, {
        "name" : "문래",
        "line" : "2",
        "x" : -77.5,
        "y" : -7.5
    }, {
        "name" : "신도림",
        "line" : "2",
        "x" : -77.5,
        "y" : -17.5
    }, {
        "name" : "대림",
        "line" : "2",
        "x" : -76,
        "y" : -34.5
    }, {
        "name" : "구디지털단지",
        "line" : "2",
        "x" : -70,
        "y" : -44
    }, {
        "name" : "신대방",
        "line" : "2",
        "x" : -60.5,
        "y" : -50
    }, {
        "name" : "신림",
        "line" : "2",
        "x" : -48,
        "y" : -51
    }, {
        "name" : "봉천",
        "line" : "2",
        "x" : -35.5,
        "y" : -51
    }, {
        "name" : "서울대입구",
        "line" : "2",
        "x" : -23,
        "y" : -51
    }, {
        "name" : "낙성대",
        "line" : "2",
        "x" : -10,
        "y" : -51
    }, {
        "name" : "한티",
        "line" : "분당선",
        "x" : 62,
        "y" : -62
    }, {
        "name" : "선정릉",
        "line" : "분당선",
        "x" : 62,
        "y" : -35
    }, {
        "name" : "강남구청",
        "line" : "분당선",
        "x" : 62,
        "y" : 7
    }, {
        "name" : "압구정로데오",
        "line" : "분당선",
        "x" : 62,
        "y" : 15
    }, {
        "name" : "서울숲",
        "line" : "분당선",
        "x" : 62,
        "y" : 38.5
    }, {
        "name" : "응봉",
        "line" : "경의중앙선",
        "x" : 46,
        "y" : 35
    }, {
        "name" : "옥수",
        "line" : "경의중앙선",
        "x" : 27,
        "y" : 16.5
    }, {
        "name" : "한남",
        "line" : "경의중앙선",
        "x" : 19.5,
        "y" : 9.5
    }, {
        "name" : "서빙고",
        "line" : "경의중앙선",
        "x" : 12.5,
        "y" : 2
    }, {
        "name" : "용산",
        "line" : "경의중앙선",
        "x" : -23,
        "y" : 7
    }, {
        "name" : "효창공원앞",
        "line" : "경의중앙선",
        "x" : -35,
        "y" : 27
    }, {
        "name" : "공덕",
        "line" : "경의중앙선",
        "x" : -40,
        "y" : 33
    }, {
        "name" : "서강대",
        "line" : "경의중앙선",
        "x" : -58.5,
        "y" : 33
    }, {
        "name" : "동대입구",
        "line" : "3",
        "x" : 18.5,
        "y" : 52.5
    }, {
        "name" : "약수",
        "line" : "3",
        "x" : 27,
        "y" : 41
    }, {
        "name" : "금호",
        "line" : "3",
        "x" : 27,
        "y" : 27
    }, {
        "name" : "압구정",
        "line" : "3",
        "x" : 27,
        "y" : -2.5
    }, {
        "name" : "신사",
        "line" : "3",
        "x" : 27,
        "y" : -10
    }, {
        "name" : "잠원",
        "line" : "3",
        "x" : 27,
        "y" : -17
    }, {
        "name" : "고속터미널",
        "line" : "3",
        "x" : 27,
        "y" : -24.5
    }, {
        "name" : "남부터미널",
        "line" : "3",
        "x" : 28,
        "y" : -64.5
    }
];
