var data_line3 = [
    { "id" : "", "name" : "을지로3가", "line" : "3", "x" : -6.5, "y" : 66 },
    { "id" : "", "name" : "충무로", "line" : "3", "x" : 0, "y" : 53.5 },
    { "id" : "", "name" : "동대입구", "line" : "3", "x" : 18.5, "y" : 52.5 },
    { "id" : "", "name" : "약수", "line" : "3", "x" : 27, "y" : 41 },
    { "id" : "", "name" : "금호", "line" : "3", "x" : 27, "y" : 27 },
    { "id" : "", "name" : "압구정", "line" : "3", "x" : 27, "y" : -2.5 },
    { "id" : "", "name" : "신사", "line" : "3", "x" : 27, "y" : -10 },
    { "id" : "", "name" : "잠원", "line" : "3", "x" : 27, "y" : -17 },
    { "id" : "", "name" : "고속터미널", "line" : "3", "x" : 27, "y" : -24.5 },
    { "id" : "", "name" : "남부터미널", "line" : "3", "x" : 28, "y" : -64.5 }
];
