var data_line4 = [
    { "name" : "동대문역사", "line" : "4", "x" : 11, "y" : 66 },
    { "name" : "충무로", "line" : "4", "x" : 0, "y" : 53.5 },
    { "name" : "명동", "line" : "4", "x" : -9, "y" : 53.5 },
    { "name" : "회현", "line" : "4", "x" : -17.5, "y" : 49.5 },
    { "name" : "서울역", "line" : "4", "x" : -22, "y" : 41 },
    { "name" : "숙대입구", "line" : "4","x" : -17.5, "y" : 31.5 },
    { "name" : "심각지", "line" : "4", "x" : -7.5, "y" : 28.4 },
    { "name" : "신용산", "line" : "4", "x" : 0, "y" : 16.5 },
    { "name" : "이촌", "line" : "4", "x" : 0, "y" : 0 },
    { "name" : "동작", "line" : "4", "x" : 0, "y" : -17 },
    { "name" : "충신대", "line" : "4", "x" : 0, "y" : -34 },
    { "name" : "남태령", "line" : "4", "x" : 0, "y" : -60 },
    { "name" : "선바위", "line" : "4", "x" : 0, "y" : -68 }
];
